{
  "language": "en",
  "subtitle": "19 year-old student, currently at Aix-Marseille, IT dept.",
  "here": "here",
  "available": "available",
  "follows": "Following",
  "followers": "followers",
  "people": "people",
  "menu-projects": "Projects",
  "menu-contact": "Contact",
  "menu-sources": "Sources",
  "about-me": "About me",
  "about-me.section": "I've always been curious; I've explored a lot of different stuff knowing well what I was about to become later.\nThat's how I got myself a few hobbies: biking, running, art (thanks to Art History, and thanks to the teacher that made Art and French interesting!) I'm fond of TV shows, movies and musics (but I guess that's our generation, with such platforms like Netflix or Spotify that made this kind of stuff reachable.)",
  "description": "... And IT in all of this?",
  "description.section": "I've always been interested in this line of business. My curiosity and my ability to be self-taught are two qualities that have always enabled me to progress in this field. I have always done little things in my corner for my pleasure, and combining work and passion is the goal I have set for myself. As a kid, I spent my time watching YouTube videos and guides, visiting lost druid forums to understand how everything worked! I had started playing with the Java programming language in order to modify the Minecraft game. Time flies and then I started doing some projects in my corner, static and dynamic websites, with various programming languages ​​/ platforms although I have a preference for NodeJS. I've also done other cool things like home automation projects, electronics interest me a lot too. I am currently in the first year of a DUT in IT, promotion of 2020-2021.",
  "description.see-projects": "You can take a look at the projects I've realized",
  "footer.title.address": "My address",
  "footer.title.mail": "Mail",
  "footer.title.change-language": "Language",
  "footer.title.change-theme": "Theme",
  "footer.description.1": "This website has been created during the end of the year 2020. It uses only HTML5, CSS3, and JavaScript. I've got another version of my website ",
  "footer.description.2": ", that used another technologies (NextJS, React), but it was irrelevant to the",
  "footer.description.3": "project we've been asked to make",
  "github.repo": "GitHub repo",
  "github.repo.public": "public repos",
  "github.contrib.unofficial.api": "Unofficial API Contribution",
  "reddit.post": "Reddit Post",
  "projects.header.1": "My pro",
  "projects.header.2": "jects",
  "projects.used.resources": "Used resources",
  "projects.used.resources.pug": "Pug Render Engine",
  "projects.used.resources.electron": "Cross-platform desktop apps framework using HTML/JS/CSS",
  "projects.used.resources.nodejs": "Open source JavaScript environment running outside a web browser",
  "projects.used.resources.nextjs": "An open-source React front-end development web framework that enables functionality such as server-side rendering and generating static websites for React based web applications.",
  "projects.1.desc": "I'm often playing with new players who doesn't have enough time to understand every aspect of the game, so this program handles those aspects automatically. By far my most popular project.",
  "projects.2.desc": "A prototype that aggregates new mails and fetches Zoom/Google Meet links, and saves them in a database. The website, using NextJS+React shows those links and is linked to a Discord channel using webhooks.",
  "projects.3.desc": "Reverse engineering of Pronote APIs to provide an interface more similar to the standards of recent years, plus an almost-instant loading and a few other interesting functionalities. Playground for HTTP/2, Progressive Web Apps, and Push Notifications",
  "projects.4.desc": "Website that used to allow sync between user's players, so people could create a room, and watch a movie together, while being able to pause for everyone, etc. The website isn't open to public. Playground for NextJS, React, Material UI, and WebSocket.",
  "cv.link.1": "You can access the file",
  "cv.link.2": "if your browser doesn't show you the PDF here.",
  "cv.updated": "Updated last summer",
  "contact.form.1": "Contact",
  "contact.form.2": "form",
  "contact.form.label.mail": "Mail address",
  "contact.form.label.message": "Message",
  "contact.form.submit": "Submit",
  "contact.form.open.client": "Open mail client",
  "sources.header.1": "Sour",
  "sources.header.2": "ces",
  "sources.link.1": "The best website to keep notes I believe",
  "sources.link.2": "Panda - a news tech/design/dev feed",
  "sources.link.3": "Flat UI Colors 2",
  "sources.link.4": "How to: CSS Loader (W3Schools)",
  "sources.link.5": "Markup Validation Service",
  "sources.link.6": "Graphic inspirations",
  "sources.link.7": "Contact form",
  "sources.link.8": "Templating Engine (inspired from this to created i18n script)",
  "sources.link.9": "The website I had created for my Parcoursup project"
}
