{
  "language": "English",
  "subtitle": "19 year-old student, currently at Aix-Marseille, IT dept.",
  "here": "here",
  "available": "available",
  "menu-projects": "Projects",
  "menu-contact": "Contact",
  "menu-sources": "Sources",
  "about-me": "About me",
  "about-me.section": "I've always been curious; I've explored a lot of different stuff knowing well what I was about to become later.\nThat's how I got myself a few hobbies: biking, running, art (thanks to Art History, and thanks to the teacher that made Art and French interesting!) I'm fond of TV shows, movies and musics (but I guess that's our generation, with such platforms like Netflix or Spotify that made this kind of stuff reachable.)",
  "description": "... And IT in all of this?",
  "description.section": "I've always been interested in computer science. Being a self-taught, I've taught myself programming languages to be able to succeed in different objectives I had given myself. When I was 13, I started playing with the Java programming language, to modify the well-known video-game called Minecraft. Then I started making projects in my corner, from static websites to dynamic websites, using libraries like jQuery. Recently I learned React (+ NextJS), a really good framework to my mind because when you know how to use it, you can make stuff pretty easily. I've also done desktop apps using C#, but more recently using Electron and NodeJS.",
  "description.see-projects": "You can take a look at the projects I've realized",
  "footer.title.address": "My address",
  "footer.title.mail": "Mail",
  "footer.description.1": "This website has been created during the end of the year 2020. It uses only HTML5, CSS3, and JavaScript. I've got another version of my website ",
  "footer.description.2": ", that used another technologies (NextJS, React), but it was irrelevant to the",
  "footer.description.3": "project we've been asked to make.",
  "github.repo": "GitHub repo",
  "github.contrib.unofficial.api": "Unofficial API Contribution",
  "reddit.post": "Reddit Post",
  "projects.header.1": "My pro",
  "projects.header.2": "jects",
  "projects.used.resources": "Used resources",
  "projects.used.resources.pug": "Pug Render Engine",
  "projects.used.resources.electron": "Cross-platform desktop apps framework using JavaScript, HTML, and CSS",
  "projects.used.resources.nodejs": "Open source JavaScript environment running outside a web browser",
  "projects.used.resources.nextjs": "An open-source React front-end development web framework that enables functionality such as server-side rendering and generating static websites for React based web applications.",
  "projects.1.desc": "I'm often playing with new players who doesn't have enough time to understand every aspect of the game, so this program handles those aspects automatically. By far my most popular project.",
  "projects.2.desc": "A prototype that aggregates new mails and fetches Zoom/Google Meet links, and saves them in a database. The website, using NextJS+React shows those links and is linked to a Discord channel using webhooks.",
  "projects.3.desc": "Reverse engineering of Pronote APIs to provide an interface more similar to the standards of recent years, plus an almost-instant loading and a few other interesting functionalities. Playground for HTTP/2, Progressive Web Apps, and Push Notifications",
  "projects.4.desc": "Website that used to allow sync between user's players, so people could create a room, and watch a movie together, while being able to pause for everyone, etc. The website isn't open to public. Playground for NextJS, React, Material UI, and WebSocket."
}
